espressif/esp-idf/components/soc/esp32s31/register/soc/ieee802154_reg.h
#define RX_TIMEOUT_TARGET_CNT_REG (IEEE802154_REG_BASE + 0x18c)
#define RX_TIMEOUT_TARGET_CNT 0x00FFFFFF
#define RX_TIMEOUT_TARGET_CNT_S 0

#define MODSLP_CONFIG_REG (IEEE802154_REG_BASE + 0x190)
#define MODSLP_RUN_TIME_LIMIT 0x0000000F
#define MODSLP_RUN_TIME_LIMIT_S 4
#define MODSLP_INTR_WAKE_EN (BIT(3))
#define MODSLP_INTR_WAKE_EN_S 3
#define MODSLP_RFOFF_WAKE_EN (BIT(2))
#define MODSLP_RFOFF_WAKE_EN_S 2
#define MODSLP_RUN_TIME_WAKE_EN (BIT(1))
#define MODSLP_RUN_TIME_WAKE_EN_S 1
#define MODSLP_MODE_ENA (BIT(0))
#define MODSLP_MODE_ENA_S 0

#define MODSLP_STATUS_REG (IEEE802154_REG_BASE + 0x194)
#define MODSLP_RUN_TIME_CNT 0x0000000F
#define MODSLP_RUN_TIME_CNT_S 4
#define MODSLP_INTR_WAKE (BIT(3))
#define MODSLP_INTR_WAKE_S 3
#define MODSLP_INTR_WAKE_CLR (BIT(3))
#define MODSLP_INTR_WAKE_CLR_S 3
#define MODSLP_RFOFF_WAKE (BIT(2))
#define MODSLP_RFOFF_WAKE_S 2
#define MODSLP_RFOFF_WAKE_CLR (BIT(2))
#define MODSLP_RFOFF_WAKE_CLR_S 2
#define MODSLP_RUN_TIME_WAKE (BIT(1))
#define MODSLP_RUN_TIME_WAKE_S 1
#define MODSLP_RUN_TIME_WAKE_CLR (BIT(1))
#define MODSLP_RUN_TIME_WAKE_CLR_S 1

#define MODSLP_WW_REG (IEEE802154_REG_BASE + 0x198)
#define MODSLP_WW_DELTA 0x0000FFFF
#define MODSLP_WW_DELTA_S 16
#define MODSLP_WW_INI 0x0000FFFF
#define MODSLP_WW_INI_S 0

#define MODSLP_INTR_WAKE_CONFIG_REG (IEEE802154_REG_BASE + 0x19c)
#define MODSLP_INTR_WAKE_CONFIG 0x00003FFF
#define MODSLP_INTR_WAKE_CONFIG_S 0

#define IEEE802154_MAC_DATE_REG (IEEE802154_REG_BASE + 0x1a0)
#define IEEE802154_MAC_DATE 0xFFFFFFFF
#define IEEE802154_MAC_DATE_S 0
#define IEEE802154_MAC_DATE_VERSION 0x2508180

// For ETM feature.
#define ETM_REG_BASE    0x20108800  //#define DR_REG_MODEM_ETM_BASE      (MODEM_BASE + 0x8800)
#define ETM_CHEN_AD0_REG (ETM_REG_BASE + 0x0000)
#define ETM_CHENSET_AD0_REG (ETM_REG_BASE + 0x0004)
#define ETM_CHENCLR_AD0_REG (ETM_REG_BASE + 0x0008)
#define ETM_CH0_EVT_ID_REG (ETM_REG_BASE + 0x000c)
#define ETM_CH0_TASK_ID_REG (ETM_REG_BASE + 0x0010)

#define ETM_CH_OFFSET 0x08

#define ETM_EVENT_TIMER1_OVERFLOW  79
#define ETM_EVENT_TIMER0_OVERFLOW  80
#define ETM_TASK_ED_TRIG_TX        84
#define ETM_TASK_RX_START          85
#define ETM_TASK_TX_START          88

#ifdef __cplusplus
}
#endif
